signagestore/app/controllers/api/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def product
    @product ||= Product.find(product_id)