signagestore/app/controllers/api/users_controller.rb

  def create
    render json: { message: 'Successful creation, please login', user: User.create!(create_user_attributes) }, status: :created
---
INSERT INTO "users" ("uid", "encrypted_password", "email", "kind", "tokens", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"